{
  "metadata": {
    "scraped_at": "2025-10-21T16:10:03.011620",
    "total_events": 72,
    "source": "local_scraping",
    "description": "Events scraped from Seniors Kingston website"
  },
  "events": [
    {
      "title": "close X",
      "startDate": "2025-10-21T16:09:47.295153Z",
      "endDate": "2025-10-21T17:09:47.295169Z",
      "description": "Advertisement 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca Get Involved Register Today Upcoming Events Click on an event in the list or calendar to view details and registration information. Events are open to the public. Calendar View October 21, 5:30 pm Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere. Wait... there's more! Take a look at our engaging programs that seniors love! Enhancing the quality of life for seniors throughout our community. Quick Links Hatter's Menu 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca @KingstonSeniors Latest Program Guide Copyright © 2025 The Seniors Association Kingston Region Developed and Powered by allCare IT",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "8:30am",
      "image_url": "https://cms.seniorskingston.ca/assets/85fc1e02-43be-48e4-85b1-c27028ca3a3e/Your%20Ad%20Here.jpg"
    },
    {
      "title": "close X",
      "startDate": "2025-10-21T16:09:47.502496Z",
      "endDate": "2025-10-21T17:09:47.502505Z",
      "description": "Advertisement 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca Get Involved Register Today Upcoming Events Click on an event in the list or calendar to view details and registration information. Events are open to the public. Calendar View October 21, 5:30 pm Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere. Wait... there's more! Take a look at our engaging programs that seniors love! Enhancing the quality of life for seniors throughout our community. Quick Links Hatter's Menu 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca @KingstonSeniors Latest Program Guide Copyright © 2025 The Seniors Association Kingston Region Developed and Powered by allCare IT",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "8:30am",
      "image_url": "https://cms.seniorskingston.ca/assets/85fc1e02-43be-48e4-85b1-c27028ca3a3e/Your%20Ad%20Here.jpg"
    },
    {
      "title": "close X",
      "startDate": "2025-10-21T16:09:47.693395Z",
      "endDate": "2025-10-21T17:09:47.693409Z",
      "description": "Advertisement 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca Get Involved Register Today Upcoming Events Click on an event in the list or calendar to view details and registration information. Events are open to the public. Calendar View October 21, 5:30 pm Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere. Wait... there's more! Take a look at our engaging programs that seniors love! Enhancing the quality of life for seniors throughout our community. Quick Links Hatter's Menu 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca @KingstonSeniors Latest Program Guide Copyright © 2025 The Seniors Association Kingston Region Developed and Powered by allCare IT",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "8:30am",
      "image_url": "https://cms.seniorskingston.ca/assets/85fc1e02-43be-48e4-85b1-c27028ca3a3e/Your%20Ad%20Here.jpg"
    },
    {
      "title": "close X",
      "startDate": "2025-10-21T16:09:47.734367Z",
      "endDate": "2025-10-21T17:09:47.734376Z",
      "description": "Advertisement",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/85fc1e02-43be-48e4-85b1-c27028ca3a3e/Your%20Ad%20Here.jpg"
    },
    {
      "title": "56 Francis St, Kingston, ON K7M 1L7",
      "startDate": "2025-10-21T16:09:47.809501Z",
      "endDate": "2025-10-21T17:09:47.809509Z",
      "description": "(613) 548-7810 info@seniorskingston.ca",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "8:30am",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/instagram.5e7412a.svg"
    },
    {
      "title": "56 Francis St, Kingston, ON K7M 1L7",
      "startDate": "2025-10-21T16:09:47.842881Z",
      "endDate": "2025-10-21T17:09:47.842890Z",
      "description": "(613) 548-7810 info@seniorskingston.ca",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "8:30am",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/instagram.5e7412a.svg"
    },
    {
      "title": "56 Francis St, Kingston, ON K7M 1L7",
      "startDate": "2025-10-21T16:09:47.883592Z",
      "endDate": "2025-10-21T17:09:47.883606Z",
      "description": "(613) 548-7810 info@seniorskingston.ca",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "8:30am",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/instagram.5e7412a.svg"
    },
    {
      "title": "Get Active",
      "startDate": "2025-10-21T16:09:48.098743Z",
      "endDate": "2025-10-21T17:09:48.098761Z",
      "description": "",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/main-logo.a19f194.webp"
    },
    {
      "title": "Get Active",
      "startDate": "2025-10-21T16:09:48.182906Z",
      "endDate": "2025-10-21T17:09:48.182916Z",
      "description": "",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/donate-icon.da7dda1.svg"
    },
    {
      "title": "Get Active",
      "startDate": "2025-10-21T16:09:48.258644Z",
      "endDate": "2025-10-21T17:09:48.258653Z",
      "description": "",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/donate-icon.da7dda1.svg"
    },
    {
      "title": "Get Active",
      "startDate": "2025-10-21T16:09:48.316969Z",
      "endDate": "2025-10-21T17:09:48.316977Z",
      "description": "",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/donate-icon.da7dda1.svg"
    },
    {
      "title": "Get Involved",
      "startDate": "2025-10-21T16:09:48.810193Z",
      "endDate": "2025-10-21T17:09:48.810203Z",
      "description": "Register Today Upcoming Events Click on an event in the list or calendar to view details and registration information. Events are open to the public. Calendar View Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere. Wait... there's more! Take a look at our engaging programs that seniors love!",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Register Today",
      "startDate": "2025-10-21T16:09:49.129973Z",
      "endDate": "2025-10-21T17:09:49.129987Z",
      "description": "Upcoming Events Click on an event in the list or calendar to view details and registration information. Events are open to the public. Calendar View Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Register Today",
      "startDate": "2025-10-21T16:09:49.302824Z",
      "endDate": "2025-10-21T17:09:49.302848Z",
      "description": "Upcoming Events Click on an event in the list or calendar to view details and registration information. Events are open to the public. Calendar View Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Register Today",
      "startDate": "2025-10-21T16:09:49.541859Z",
      "endDate": "2025-10-21T17:09:49.541867Z",
      "description": "Upcoming Events Click on an event in the list or calendar to view details and registration information. Events are open to the public. Calendar View Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Sound Bath",
      "startDate": "2025-10-21T16:09:49.860446Z",
      "endDate": "2025-10-21T17:09:49.860453Z",
      "description": "Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Sound Bath",
      "startDate": "2025-10-21T16:09:50.037647Z",
      "endDate": "2025-10-21T17:09:50.037659Z",
      "description": "Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Sound Bath",
      "startDate": "2025-10-21T16:09:50.209663Z",
      "endDate": "2025-10-21T17:09:50.209670Z",
      "description": "Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and Board Meeting October 22, 4:00 pm The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval. Paint with Gouache October 23, 10:00 am After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included. Achieve Your Best Health October 23, 1:00 pm Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community. Sound Escapes: Kenny & Dolly October 24, 1:30 pm Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic. Wearable Tech October 27, 12:00 pm Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb Legal Advice October 27, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. 18th Century Astronomy October 30, 1:00 pm The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved. Caroles Dance Party October 30, 1:00 pm Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810 Daylight Savings Ends November 2, 8:00 am Online Registration Begins November 3, 8:00 am Online Program Registration Starts Today Assistive Listening Solutions November 3, 12:00 pm Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces. In-Person Registration for Session 2 Begins November 4, 8:30 am In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information. Fresh Food Market November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Fraud Awareness November 5, 1:00 pm Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club Cut. Fold. Glue. Stars. November 6, 11:30 am Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson Learn about Tarot November 6, 1:00 pm Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide. Hearing Clinic November 7, 9:00 am Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required. Coffee with a Cop November 7, 10:00 am Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome. Cut. Fold. Glue. Trees November 10, 10:45 am Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson Shopping & Buying Online November 10, 12:00 pm Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs. Legal Advice November 10, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Service Canada Clinic November 12, 9:00 am Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan. Coast to Coast: A Canoe Odyssey November 13, 1:00 pm Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways. Birthday Lunch November 14, 12:00 pm Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert. Sound Escapes: Georgette Fry November 14, 1:30 pm Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by Program Break Week November 17, 8:30 am No programs are scheduled at any Seniors Association locations. Speed Friending November 17, 1:00 pm Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes. Advanced Care Planning November 17, 4:30 pm The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan. Fresh Food Market November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Expressive Mark Making November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style. Cafe Franglish November 18, 2:30 pm Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics. Tuesday at Tom’s November 18, 3:00 pm New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members. Learn Resilience November 19, 9:30 am Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact. Vision Workshop November 19, 10:30 am Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence. New Member Mixer November 19, 2:00 pm Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing. Time for Tea November 20, 1:00 pm Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season. Book & Puzzle EXCHANGE November 21, 10:00 am Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2. Annual General Meeting November 21, 11:00 am The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre. December Vista Available for Pickup November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy. Holiday Artisan Fair November 22, 10:00 am Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find Simplify Your Digital Life November 24, 12:00 pm Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world. Legal Advice November 24, 1:00 pm A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810 Fresh Food Market November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet. Holiday Lunch November 25, 12:00 pm Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810 Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley November 26, 7:30 pm Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights. Anxiety Unlocked November 27, 1:00 pm Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Sound Bath",
      "startDate": "2025-10-21T16:09:50.256771Z",
      "endDate": "2025-10-21T17:09:50.256779Z",
      "description": "Learn how to become calmer and more centred through the use of sound therapy. Drift off into a dream-like state and experience healing and balance through shifts in your mental, physical and",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 21",
      "timeStr": "5:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5e815490-28b8-4751-bd6b-9aca1328f887/Learn%20&%20Play.jpg"
    },
    {
      "title": "Board Meeting",
      "startDate": "2025-10-21T16:09:50.358929Z",
      "endDate": "2025-10-21T17:09:50.358941Z",
      "description": "The next scheduled Board meeting is October 22, 4:00pm, at The Seniors Centre. Members and the public are welcome to attend. Board minutes are posted on the website and at The Seniors Centre following their approval.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 22",
      "timeStr": "4:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/03969dc2-152c-4124-9dd9-f0764c3e0252/Board%20Meeting.jpg"
    },
    {
      "title": "Paint with Gouache",
      "startDate": "2025-10-21T16:09:50.440332Z",
      "endDate": "2025-10-21T17:09:50.440347Z",
      "description": "After learning the properties and techniques of this unique watercolour, students will use their knowledge to complete work of their choosing. All materials included.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 23",
      "timeStr": "10:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/5f9c11ff-1260-4aa4-8cb3-19936ecbdc4e/Learn%20&%20Play.jpg"
    },
    {
      "title": "Achieve Your Best Health",
      "startDate": "2025-10-21T16:09:50.523345Z",
      "endDate": "2025-10-21T17:09:50.523355Z",
      "description": "Learn about the Frontenac Lennox & Addington Ontario Health Team, working to provide connected, team-based care that supports overall wellness and improves home care services for adults in our community.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 23",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/1444a77f-b919-494d-bfe1-87ae130cbdf5/Featured%20Speaker.jpg"
    },
    {
      "title": "Sound Escapes: Kenny & Dolly",
      "startDate": "2025-10-21T16:09:50.606356Z",
      "endDate": "2025-10-21T17:09:50.606363Z",
      "description": "Celebrate timeless hits in this unforgettable tribute concert. Relive legendary duets and solo classics, blending heart, humor, and harmony in a performance of pure country magic.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 24",
      "timeStr": "1:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/bd103f00-5824-449d-9a8d-74dd98f450c3/Sound%20Escapes%202.jpg"
    },
    {
      "title": "Wearable Tech",
      "startDate": "2025-10-21T16:09:50.680220Z",
      "endDate": "2025-10-21T17:09:50.680231Z",
      "description": "Smartwatches and fitness trackers have become increasing popular. Learn how wearable technology can support your health, fitness and everyday activities. Instructor: Sam Kalb",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 27",
      "timeStr": "12:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/9ac584b0-0bc5-4803-a59b-dd48f5589df7/Tech%20Bytes.jpg"
    },
    {
      "title": "Legal Advice",
      "startDate": "2025-10-21T16:09:50.767016Z",
      "endDate": "2025-10-21T17:09:50.767024Z",
      "description": "A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 27",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/ff281879-79a3-45e3-ab4c-b54f69a2e371/Legal%20Advice.JPG"
    },
    {
      "title": "Fresh Food Market",
      "startDate": "2025-10-21T16:09:50.867157Z",
      "endDate": "2025-10-21T17:09:50.867168Z",
      "description": "October 28, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/6d7e0dd8-63c7-45ff-916d-67280d4f9966/Fresh%20Food%20Market.jpg"
    },
    {
      "title": "18th Century Astronomy",
      "startDate": "2025-10-21T16:09:50.950100Z",
      "endDate": "2025-10-21T17:09:50.950110Z",
      "description": "The 1700s changed our view of the universe. Hear about the first “X” prize, the solar system, deep sky objects, the distance to the stars and the remarkable men and women involved.",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 30",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/1444a77f-b919-494d-bfe1-87ae130cbdf5/Featured%20Speaker.jpg"
    },
    {
      "title": "Caroles Dance Party",
      "startDate": "2025-10-21T16:09:51.034535Z",
      "endDate": "2025-10-21T17:09:51.034543Z",
      "description": "Let’s Dance! Join Carole for spooky tunes and groovy moves. Supportive footwear is mandatory. Instructor: Carole Gibson services REGISTER Call 613.548.7810",
      "location": "Seniors Kingston Centre",
      "dateStr": "October 30",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5f877585-1735-45c2-b513-2bbe20e82f88/Caroles%20Dance%20Party.jpg"
    },
    {
      "title": "Daylight Savings Ends",
      "startDate": "2025-10-21T16:09:51.122179Z",
      "endDate": "2025-10-21T17:09:51.122188Z",
      "description": "",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 2",
      "timeStr": "8:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/d2758d2b-f79b-49db-9f4e-f55928b48126/Daylight%20Savings%20Time.jpg"
    },
    {
      "title": "Online Registration Begins",
      "startDate": "2025-10-21T16:09:51.196868Z",
      "endDate": "2025-10-21T17:09:51.196882Z",
      "description": "Online Program Registration Starts Today",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 3",
      "timeStr": "8:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/4d931fd1-40ac-4785-bcae-81d0647e6cf7/Registration%20Online.jpg"
    },
    {
      "title": "Assistive Listening Solutions",
      "startDate": "2025-10-21T16:09:51.273446Z",
      "endDate": "2025-10-21T17:09:51.273458Z",
      "description": "Removing communication barriers leads to engagement within the community. Learn about how assistive listening solutions can help hard-of-hearing members remove background noise and hear what they are intended to. This session will provide an overview of the solutions available today and how they can benefit those who struggle to hear in public spaces.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 3",
      "timeStr": "12:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/94872db8-dee1-41c2-9fcb-1a8315487c24/Tech%20Bytes.jpg"
    },
    {
      "title": "In-Person Registration for Session 2 Begins",
      "startDate": "2025-10-21T16:09:51.349389Z",
      "endDate": "2025-10-21T17:09:51.349398Z",
      "description": "In-person and mail registration begins Monday November 3 at 8:30am. Session 2 begins November 27. CLICK HERE for program information.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 4",
      "timeStr": "8:30 am",
      "image_url": "https://cms.seniorskingston.ca/assets/db8c6611-9f72-43f4-8fae-7025e3e82534/Registration%20In-person.jpg"
    },
    {
      "title": "Fresh Food Market",
      "startDate": "2025-10-21T16:09:51.428495Z",
      "endDate": "2025-10-21T17:09:51.428514Z",
      "description": "November 4, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/6d7e0dd8-63c7-45ff-916d-67280d4f9966/Fresh%20Food%20Market.jpg"
    },
    {
      "title": "Fraud Awareness",
      "startDate": "2025-10-21T16:09:51.515810Z",
      "endDate": "2025-10-21T17:09:51.515819Z",
      "description": "Protect your money and identity from phone, internet, and in-person fraudsters. Learn how to spot and avoid scams. Facilitator: Paul Van Nest, Kingston Rotary Club",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 5",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/cb66e913-8ddb-4252-a74c-4302cec7540f/PFH%20Wednesday%20PM.jpg"
    },
    {
      "title": "Cut. Fold. Glue. Stars.",
      "startDate": "2025-10-21T16:09:51.593176Z",
      "endDate": "2025-10-21T17:09:51.593185Z",
      "description": "Join Carole and learn to make charming loo roll snowflakes to bring whimsy to your winter decor. Instructor: Carole Gibson",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 6",
      "timeStr": "11:30 am",
      "image_url": "https://cms.seniorskingston.ca/assets/a538b972-f854-424b-b155-a1a48515fd6a/Learn%20&%20Play.jpg"
    },
    {
      "title": "Learn about Tarot",
      "startDate": "2025-10-21T16:09:51.677342Z",
      "endDate": "2025-10-21T17:09:51.677355Z",
      "description": "Tarocchini is a card game where trumps take tricks. Created in 1400 in Italy, it has evolved into games like Bridge. Is Tarot a game of fortune telling, tricks, or a psychological study? Come play and decide.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 6",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/1444a77f-b919-494d-bfe1-87ae130cbdf5/Featured%20Speaker.jpg"
    },
    {
      "title": "Hearing Clinic",
      "startDate": "2025-10-21T16:09:51.765469Z",
      "endDate": "2025-10-21T17:09:51.765478Z",
      "description": "Holly Brooks, Hearing Instrument Specialist, from Hear Right Canada provides hearing tests and hearing aid cleaning. Batteries also available for a fee. Appointments required.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 7",
      "timeStr": "9:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/4b3c4ee7-17b6-4401-9f6f-27303d9ab94f/Hearing%20Clinic.jpg"
    },
    {
      "title": "Coffee with a Cop",
      "startDate": "2025-10-21T16:09:51.857405Z",
      "endDate": "2025-10-21T17:09:51.857416Z",
      "description": "Join Constable Anthony Colangeli for coffee and conversation. Ask questions and voice concerns. Walk-in. All are welcome.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 7",
      "timeStr": "10:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/7c4a9916-5533-45e6-9a5a-45e7a6a9d252/Coffee%20with%20a%20cop%20FIXED.jpg"
    },
    {
      "title": "Cut. Fold. Glue. Trees",
      "startDate": "2025-10-21T16:09:51.975830Z",
      "endDate": "2025-10-21T17:09:51.975841Z",
      "description": "Join Carole and learn to make fanciful paper trees for your holiday tablescapes. Instructor: Carole Gibson",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 10",
      "timeStr": "10:45 am",
      "image_url": "https://cms.seniorskingston.ca/assets/a538b972-f854-424b-b155-a1a48515fd6a/Learn%20&%20Play.jpg"
    },
    {
      "title": "Shopping & Buying Online",
      "startDate": "2025-10-21T16:09:52.060997Z",
      "endDate": "2025-10-21T17:09:52.061005Z",
      "description": "Dip your toes into online shopping. Learn how to get the most out of online stores, how to comparison shop and making informed purchases and how to choose streaming services for movies and TV programs.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 10",
      "timeStr": "12:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/94872db8-dee1-41c2-9fcb-1a8315487c24/Tech%20Bytes.jpg"
    },
    {
      "title": "Legal Advice",
      "startDate": "2025-10-21T16:09:52.158893Z",
      "endDate": "2025-10-21T17:09:52.158901Z",
      "description": "A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 10",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/ff281879-79a3-45e3-ab4c-b54f69a2e371/Legal%20Advice.JPG"
    },
    {
      "title": "Fresh Food Market",
      "startDate": "2025-10-21T16:09:52.248994Z",
      "endDate": "2025-10-21T17:09:52.249004Z",
      "description": "November 11, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/6d7e0dd8-63c7-45ff-916d-67280d4f9966/Fresh%20Food%20Market.jpg"
    },
    {
      "title": "Service Canada Clinic",
      "startDate": "2025-10-21T16:09:52.407932Z",
      "endDate": "2025-10-21T17:09:52.407939Z",
      "description": "Service Canada representatives come to The Seniors Centre to help you with Canadian Pension Plan (CPP), Old Age Security (OAS), Guaranteed Income Supplement (GIS), Social Insurance Number (SIN), or Canadian Dental Care Plan.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 12",
      "timeStr": "9:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/84ef521d-3400-4aae-9953-e4811b92001c/Service%20Canada%20Clinic.jpg"
    },
    {
      "title": "Coast to Coast: A Canoe Odyssey",
      "startDate": "2025-10-21T16:09:52.488744Z",
      "endDate": "2025-10-21T17:09:52.488753Z",
      "description": "Two paddlers, one canoe, and 8,500 km from Vancouver to Sydney – through cities, towns, and wild terrain. Hear about this epic adventure of resilience, connection, and discovery across Canada’s diverse landscapes and waterways.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 13",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/1444a77f-b919-494d-bfe1-87ae130cbdf5/Featured%20Speaker.jpg"
    },
    {
      "title": "Birthday Lunch",
      "startDate": "2025-10-21T16:09:52.591821Z",
      "endDate": "2025-10-21T17:09:52.591828Z",
      "description": "Members celebrate their birthday month for free! Mixed Green Salad, Baked Ham with Scalloped Potatoes, followed by a Birthday Dessert.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 14",
      "timeStr": "12:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/e09e616f-444c-4f2d-989a-32fa84b34083/Birthday.jpg"
    },
    {
      "title": "Sound Escapes: Georgette Fry",
      "startDate": "2025-10-21T16:09:52.688834Z",
      "endDate": "2025-10-21T17:09:52.688845Z",
      "description": "Experience the award-winning Georgette Fry's soulful blend of blues, jazz, and pop. Her electrifying style will have you up and dancing all afternoon long! Sponsored by James Reid Funeral Home. Supported by",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 14",
      "timeStr": "1:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/bd103f00-5824-449d-9a8d-74dd98f450c3/Sound%20Escapes%202.jpg"
    },
    {
      "title": "Program Break Week",
      "startDate": "2025-10-21T16:09:52.762841Z",
      "endDate": "2025-10-21T17:09:52.762855Z",
      "description": "November 17, 8:30 am No programs are scheduled at any Seniors Association locations.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/569fd7a5-9905-4e34-b0f2-770421fc7e6d/Program%20Break.jpg"
    },
    {
      "title": "Speed Friending",
      "startDate": "2025-10-21T16:09:52.841863Z",
      "endDate": "2025-10-21T17:09:52.841870Z",
      "description": "Meet new people quickly in a fun, structured setting with speed friending, a platonic twist on speed dating. Rotate through brief conversations, connect with others, and potentially form lasting friendships in just minutes.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 17",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/29174fb0-87d2-4f16-9d7e-a773dca5ff2a/Speed%20Friending.jpg"
    },
    {
      "title": "Advanced Care Planning",
      "startDate": "2025-10-21T16:09:52.942169Z",
      "endDate": "2025-10-21T17:09:52.942178Z",
      "description": "The process of thinking about, writing down, and sharing your wishes/instructions with loved ones for future health care treatment if you become incapable of deciding for yourself. Learn, listen, and ask questions to help you improve your plan.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 17",
      "timeStr": "4:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/0b47a5d9-7476-44c7-ad1f-fac13a579936/Advance%20Care%20Planning.jpg"
    },
    {
      "title": "Fresh Food Market",
      "startDate": "2025-10-21T16:09:53.035705Z",
      "endDate": "2025-10-21T17:09:53.035715Z",
      "description": "November 18, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/6d7e0dd8-63c7-45ff-916d-67280d4f9966/Fresh%20Food%20Market.jpg"
    },
    {
      "title": "Expressive Mark Making",
      "startDate": "2025-10-21T16:09:53.125667Z",
      "endDate": "2025-10-21T17:09:53.125675Z",
      "description": "November 18, 1:00 pm Rekindle your passion for abstract art through expressive mark-making. This liberating workshop uses skill-building exercises and soul-nurturing prompts to unlock your subconscious, inspire creativity, and help you rediscover your unique, lyrical style.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/a538b972-f854-424b-b155-a1a48515fd6a/Learn%20&%20Play.jpg"
    },
    {
      "title": "Cafe Franglish",
      "startDate": "2025-10-21T16:09:53.205588Z",
      "endDate": "2025-10-21T17:09:53.205597Z",
      "description": "Join a monthly bilingual meetup where Francophones and Anglophones connect chat, and build confidence in both languages through lively, judgement-free conversations on a variety of engaging topics.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 18",
      "timeStr": "2:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5476e070-622a-45a3-972b-3e61bdc511f8/Cafe%20Franglish.jpg"
    },
    {
      "title": "Tuesday at Tom’s",
      "startDate": "2025-10-21T16:09:53.283698Z",
      "endDate": "2025-10-21T17:09:53.283706Z",
      "description": "New to town or looking to make new friends? Come and enjoy a relaxing conversation and beverage with other members.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 18",
      "timeStr": "3:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/c01d910e-fd8d-4135-9963-5b9a5126d1cb/Tuesdays%20at%20Tom's.jpg"
    },
    {
      "title": "Learn Resilience",
      "startDate": "2025-10-21T16:09:53.365006Z",
      "endDate": "2025-10-21T17:09:53.365015Z",
      "description": "Experience the award-winning documentary Resilience, then join Teach Resilience trainers from Kingston Community Health Centres for an engaging panel discussion of the film, speaking about trauma and its impact.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 19",
      "timeStr": "9:30 am",
      "image_url": "https://cms.seniorskingston.ca/assets/a538b972-f854-424b-b155-a1a48515fd6a/Learn%20&%20Play.jpg"
    },
    {
      "title": "Vision Workshop",
      "startDate": "2025-10-21T16:09:53.457680Z",
      "endDate": "2025-10-21T17:09:53.457688Z",
      "description": "Rediscover purpose, passion, and joy in retirement. Learn simple tools to dream again, break free from “too late” thinking, and design a vibrant next chapter – filled with meaning, connection, and confidence.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 19",
      "timeStr": "10:30 am",
      "image_url": "https://cms.seniorskingston.ca/assets/a538b972-f854-424b-b155-a1a48515fd6a/Learn%20&%20Play.jpg"
    },
    {
      "title": "New Member Mixer",
      "startDate": "2025-10-21T16:09:53.544544Z",
      "endDate": "2025-10-21T17:09:53.544551Z",
      "description": "Are you a new member and want to learn more about what we offer? Have a friend you’d like to join? Or do you just want to know more about the Seniors Association? Meet with staff and other members for a brief orientation, introduction to our database, light refreshments, and socializing.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 19",
      "timeStr": "2:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/5fcfa81b-02bf-4985-9b86-8ec565c0bb00/New%20Member%20Mixer.jpg"
    },
    {
      "title": "Time for Tea",
      "startDate": "2025-10-21T16:09:53.626302Z",
      "endDate": "2025-10-21T17:09:53.626310Z",
      "description": "Explore the fine art of tea and food pairing with a certified tea sommelier. Discover how nuanced flavors enhance cuisine through expertly selected teas and culinary harmony over the Holiday season.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 20",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/1444a77f-b919-494d-bfe1-87ae130cbdf5/Featured%20Speaker.jpg"
    },
    {
      "title": "Book & Puzzle EXCHANGE",
      "startDate": "2025-10-21T16:09:53.718758Z",
      "endDate": "2025-10-21T17:09:53.718768Z",
      "description": "Bring up to 10 paperback books or puzzles to the Rendezvous Café to exchange for any in our library. Additional books or puzzles can be purchased for $2.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 21",
      "timeStr": "10:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/7948f41c-bcf4-42d1-97aa-5c7eb4245861/Book%20&%20Puzzle.jpg"
    },
    {
      "title": "Annual General Meeting",
      "startDate": "2025-10-21T16:09:53.804246Z",
      "endDate": "2025-10-21T17:09:53.804272Z",
      "description": "The theme for the 49th Annual General Meeting is Strategic Growth for Future Success and will be held at The Seniors Centre.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 21",
      "timeStr": "11:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/ef8b1073-4e16-42fe-a4b3-3a420c056c19/Annual%20General%20Meeting.jpg"
    },
    {
      "title": "December Vista Available for Pickup",
      "startDate": "2025-10-21T16:09:53.926252Z",
      "endDate": "2025-10-21T17:09:53.926260Z",
      "description": "November 21, 12:00 pm Volunteer Deliverers pick up their bundles to hand deliver and members can pick up their individual copy.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/8c8f92ce-34ef-442e-bab9-a06836704f9d/Vista.jpg"
    },
    {
      "title": "Holiday Artisan Fair",
      "startDate": "2025-10-21T16:09:54.033984Z",
      "endDate": "2025-10-21T17:09:54.033993Z",
      "description": "Something for everyone! Join us at our second ever Holiday Artisan Fair where you'll find",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 22",
      "timeStr": "10:00 am",
      "image_url": "https://cms.seniorskingston.ca/assets/a278053e-4f35-40af-a2f6-610cfd893930/Holiday%20Artisan%20Fair.jpg"
    },
    {
      "title": "Simplify Your Digital Life",
      "startDate": "2025-10-21T16:09:54.121475Z",
      "endDate": "2025-10-21T17:09:54.121482Z",
      "description": "Feeling overwhelmed by your online accounts, passwords, and subscriptions? This presentation offers practical strategies to simplify your digital life. Learn to organize accounts, manage passwords, use cloud storage effectively, and understand your subscriptions. We’ll also explore options for closing services you no longer need – empowering you to take control of your digital world.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 24",
      "timeStr": "12:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/9ac584b0-0bc5-4803-a59b-dd48f5589df7/Tech%20Bytes.jpg"
    },
    {
      "title": "Legal Advice",
      "startDate": "2025-10-21T16:09:54.238841Z",
      "endDate": "2025-10-21T17:09:54.238850Z",
      "description": "A practicing lawyer provides confidential advice by phone. Appointment required (20 minutes max). REGISTER Call 613.548.7810",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 24",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/ff281879-79a3-45e3-ab4c-b54f69a2e371/Legal%20Advice.JPG"
    },
    {
      "title": "Fresh Food Market",
      "startDate": "2025-10-21T16:09:54.325253Z",
      "endDate": "2025-10-21T17:09:54.325261Z",
      "description": "November 25, 10:00 am Lionhearts brings fresh, affordable produce and chef-created gourmet healthy options to The Seniors Centre to help you keep your belly full without emptying your wallet.",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://cms.seniorskingston.ca/assets/6d7e0dd8-63c7-45ff-916d-67280d4f9966/Fresh%20Food%20Market.jpg"
    },
    {
      "title": "Holiday Lunch",
      "startDate": "2025-10-21T16:09:54.462794Z",
      "endDate": "2025-10-21T17:09:54.462805Z",
      "description": "Tomato Basil Soup, Roast Turkey, dressing, mashed potatoes, vegetables, cranberry sauce, and dessert! $25/person (advance tickets only) REGISTER Online or call 613.548.7810",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 25",
      "timeStr": "12:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/6d777997-6766-44ca-902a-b0c336e7b32d/Holiday%20Lunches.jpg"
    },
    {
      "title": "Domino Theatre Dress Rehearsal: Miss Bennet: Christmas at Pemberley",
      "startDate": "2025-10-21T16:09:54.573365Z",
      "endDate": "2025-10-21T17:09:54.573373Z",
      "description": "Celebrate the holidays with a witty sequel to Pride and Prejudice, where overlooked Mary Bennet discovers romance at Pemberley. Full of heart, humour, and Regency charm, this play delights.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 26",
      "timeStr": "7:30 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/365bab44-7685-4223-8319-d8dea27b3484/Domino%20Dress%20Rehearsal.jpg"
    },
    {
      "title": "Anxiety Unlocked",
      "startDate": "2025-10-21T16:09:54.652518Z",
      "endDate": "2025-10-21T17:09:54.652526Z",
      "description": "Discover fun, easy-to-use tools that bring quick relief from anxiety. Learn simple, effective techniques you may not know, designed to calm your mind, ease stress, and restore balance anytime, anywhere.",
      "location": "Seniors Kingston Centre",
      "dateStr": "November 27",
      "timeStr": "1:00 pm",
      "image_url": "https://cms.seniorskingston.ca/assets/1444a77f-b919-494d-bfe1-87ae130cbdf5/Featured%20Speaker.jpg"
    },
    {
      "title": "Enhancing the quality of life for seniors throughout our community.",
      "startDate": "2025-10-21T16:09:59.317085Z",
      "endDate": "2025-10-21T17:09:59.317096Z",
      "description": "Quick Links Hatter's Menu 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca @KingstonSeniors Latest Program Guide",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/seniors.60d9691.webp"
    },
    {
      "title": "Enhancing the quality of life for seniors throughout our community.",
      "startDate": "2025-10-21T16:09:59.375664Z",
      "endDate": "2025-10-21T17:09:59.375676Z",
      "description": "Quick Links Hatter's Menu 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca @KingstonSeniors Latest Program Guide",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/seniors.60d9691.webp"
    },
    {
      "title": "Enhancing the quality of life for seniors throughout our community.",
      "startDate": "2025-10-21T16:09:59.440386Z",
      "endDate": "2025-10-21T17:09:59.440399Z",
      "description": "Quick Links Hatter's Menu 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca @KingstonSeniors Latest Program Guide",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/seniors.60d9691.webp"
    },
    {
      "title": "Enhancing the quality of life for seniors throughout our community.",
      "startDate": "2025-10-21T16:09:59.497430Z",
      "endDate": "2025-10-21T17:09:59.497440Z",
      "description": "Quick Links Hatter's Menu 56 Francis St, Kingston, ON K7M 1L7 (613) 548-7810 info@seniorskingston.ca @KingstonSeniors Latest Program Guide",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/seniors.60d9691.webp"
    },
    {
      "title": "Enhancing the quality of life for seniors throughout our community.",
      "startDate": "2025-10-21T16:09:59.543227Z",
      "endDate": "2025-10-21T17:09:59.543237Z",
      "description": "",
      "location": "Seniors Kingston Centre",
      "dateStr": "TBA",
      "timeStr": "TBA",
      "image_url": "https://www.seniorskingston.ca/_nuxt/img/seniors.60d9691.webp"
    }
  ]
}